Updated README.md file with mermaid code
